---
kind: other
id: AllMembers.T:Autodesk.Revit.UI.Events.TextBoxEnterPressedEventArgs
source: html/e1bb32e0-3074-2bfb-b40c-8352b8372b9c.htm
---
# TextBoxEnterPressedEventArgs Members

Initializes a new instance of the TextBoxEnterPressedEventArgs class